
[
    {
      "id": "dune-herbert",
      "title": "Dune",
      "author": "Frank Herbert",
      "category": "Sci-Fi",
      "summary": "Dune tells the story of young Paul Atreides, whose family accepts the stewardship of the desert planet Arrakis. As this planet is the only source of the 'spice' melange, the most valuable substance in the universe, control of Arrakis is a coveted — and dangerous — undertaking.",
      "authorInfo": "Franklin Patrick Herbert Jr. was an American science-fiction author best known for the 1965 novel Dune and its five sequels. Though he became famous for his novels, he also wrote short stories and worked as a newspaper journalist, photographer, book reviewer, ecological consultant, and lecturer.",
      "publishedYear": 1965,
      "totalCopies": 10,
      "availableCopies": 7,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "noble families",
      "createdAt": { "seconds": 1714348800, "nanoseconds": 0 }
    },
    {
        "id": "the-hobbit-tolkien",
        "title": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "category": "Fantasy",
        "summary": "The Hobbit is a tale of high adventure, undertaken by a company of dwarves in search of dragon-guarded gold. A reluctant partner in this perilous quest is Bilbo Baggins, a comfort-loving, unambitious hobbit, who surprises even himself by his resourcefulness and skill as a burglar.",
        "authorInfo": "John Ronald Reuel Tolkien was an English writer, poet, philologist, and academic, best known as the author of the high fantasy works The Hobbit and The Lord of the Rings.",
        "publishedYear": 1937,
        "totalCopies": 12,
        "availableCopies": 9,
        "coverUrl": "https://firebasestudio.googleapis.com/v0/b/app-hosting-project.appspot.com/o/images%2Fa954f9a1-00cc-40b9-873b-f6bd7a477380?alt=media&token=8e244670-3544-48f8-b18a-f529e71e98d9",
        "hint": "fantasy adventure",
        "createdAt": { "seconds": 1714435200, "nanoseconds": 0 }
    },
    {
      "id": "brave-new-world-huxley",
      "title": "Brave New World",
      "author": "Aldous Huxley",
      "category": "Dystopian",
      "summary": "Brave New World is a dystopian novel by English author Aldous Huxley, written in 1931 and published in 1932. Largely set in a futuristic World State, whose citizens are environmentally engineered into an intelligence-based social hierarchy, the novel anticipates huge scientific advancements in reproductive technology, sleep-learning, psychological manipulation and classical conditioning that are combined to make a dystopian society which is challenged by only a single individual: the story's protagonist.",
      "authorInfo": "Aldous Leonard Huxley was an English writer and philosopher. He wrote nearly 50 books—both novels and non-fiction works—as well as wide-ranging essays, narratives, and poems.",
      "publishedYear": 1932,
      "totalCopies": 8,
      "availableCopies": 5,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "futuristic society",
      "createdAt": { "seconds": 1714521600, "nanoseconds": 0 }
    },
    {
      "id": "to-kill-a-mockingbird-lee",
      "title": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "category": "Classic Literature",
      "summary": "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it, To Kill A Mockingbird became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.",
      "authorInfo": "Nelle Harper Lee was an American novelist best known for her 1960 novel To Kill a Mockingbird. It won the 1961 Pulitzer Prize and has become a classic of modern American literature.",
      "publishedYear": 1960,
      "totalCopies": 15,
      "availableCopies": 11,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "courtroom drama",
      "createdAt": { "seconds": 1714608000, "nanoseconds": 0 }
    },
    {
      "id": "1984-orwell",
      "title": "1984",
      "author": "George Orwell",
      "category": "Dystopian",
      "summary": "Among the seminal texts of the 20th century, Nineteen Eighty-Four is a rare work that grows more haunting as its futuristic purgatory becomes more real. Published in 1949, the book offers political satirist George Orwell's nightmarish vision of a totalitarian, bureaucratic world and one poor stiff's attempt to find individuality.",
      "authorInfo": "Eric Arthur Blair, known by his pen name George Orwell, was an English novelist, essayist, journalist and critic. His work is characterized by lucid prose, biting social criticism, opposition to totalitarianism, and outspoken support of democratic socialism.",
      "publishedYear": 1949,
      "totalCopies": 20,
      "availableCopies": 15,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "big brother",
      "createdAt": { "seconds": 1714694400, "nanoseconds": 0 }
    },
    {
      "id": "the-great-gatsby-fitzgerald",
      "title": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "category": "Classic Literature",
      "summary": "The Great Gatsby, F. Scott Fitzgerald's third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The story of the fabulously wealthy Jay Gatsby and his new love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when 'gin was the national drink and sex the national obsession,' it is an exquisitely crafted tale of America in the 1920s.",
      "authorInfo": "Francis Scott Key Fitzgerald was an American novelist, essayist, screenwriter, and short-story writer, although he was best known for his novels depicting the flamboyance and excess of the Jazz Age—a term which he coined.",
      "publishedYear": 1925,
      "totalCopies": 12,
      "availableCopies": 12,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "roaring twenties",
      "createdAt": { "seconds": 1714780800, "nanoseconds": 0 }
    },
    {
      "id": "pride-and-prejudice-austen",
      "title": "Pride and Prejudice",
      "author": "Jane Austen",
      "category": "Romance",
      "summary": "Since its immediate success in 1813, Pride and Prejudice has remained one of the most popular novels in the English language. Jane Austen called this brilliant work 'her own darling child' and its vivacious heroine, Elizabeth Bennet, 'as delightful a creature as ever appeared in print.'",
      "authorInfo": "Jane Austen was an English novelist known primarily for her six major novels, which interpret, critique and comment upon the British landed gentry at the end of the 18th century.",
      "publishedYear": 1813,
      "totalCopies": 18,
      "availableCopies": 10,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "regency romance",
      "createdAt": { "seconds": 1714867200, "nanoseconds": 0 }
    },
    {
      "id": "the-catcher-in-the-rye-salinger",
      "title": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "category": "Classic Literature",
      "summary": "The hero-narrator of The Catcher in the Rye is an ancient child of sixteen, a native New Yorker named Holden Caulfield. Through circumstances that tend to preclude adult, secondhand description, he leaves his prep school in Pennsylvania and goes underground in New York City for three days.",
      "authorInfo": "Jerome David Salinger was an American writer best known for his 1951 novel The Catcher in the Rye. Salinger published several other books, including Nine Stories and Franny and Zooey.",
      "publishedYear": 1951,
      "totalCopies": 7,
      "availableCopies": 2,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "teenage angst",
      "createdAt": { "seconds": 1714953600, "nanoseconds": 0 }
    },
    {
      "id": "moby-dick-melville",
      "title": "Moby Dick",
      "author": "Herman Melville",
      "category": "Adventure",
      "summary": "Moby-Dick; or, The Whale is an 1851 novel by American writer Herman Melville. The book is the sailor Ishmael's narrative of the obsessive quest of Ahab, captain of the whaling ship Pequod, for revenge on Moby Dick, the giant white sperm whale that on the ship's previous voyage bit off Ahab's leg at the knee.",
      "authorInfo": "Herman Melville was an American novelist, short story writer, and poet of the American Renaissance period. Among his best-known works are Moby-Dick; Typee; and Billy Budd, Sailor.",
      "publishedYear": 1851,
      "totalCopies": 5,
      "availableCopies": 5,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "white whale",
      "createdAt": { "seconds": 1715040000, "nanoseconds": 0 }
    },
    {
      "id": "war-and-peace-tolstoy",
      "title": "War and Peace",
      "author": "Leo Tolstoy",
      "category": "Historical Fiction",
      "summary": "Leo Tolstoy's epic novel of Russian society during the Napoleonic Era. The novel chronicles the history of the French invasion of Russia and the impact of the Napoleonic era on Tsarist society through the stories of five Russian aristocratic families.",
      "authorInfo": "Count Lev Nikolayevich Tolstoy, usually referred to in English as Leo Tolstoy, was a Russian writer who is regarded as one of the greatest authors of all time.",
      "publishedYear": 1869,
      "totalCopies": 4,
      "availableCopies": 3,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "napoleonic wars",
      "createdAt": { "seconds": 1715126400, "nanoseconds": 0 }
    },
    {
      "id": "frankenstein-shelley",
      "title": "Frankenstein",
      "author": "Mary Shelley",
      "category": "Gothic Fiction",
      "summary": "Frankenstein; or, The Modern Prometheus is an 1818 novel written by English author Mary Shelley. Frankenstein tells the story of Victor Frankenstein, a young scientist who creates a sapient creature in an unorthodox scientific experiment.",
      "authorInfo": "Mary Wollstonecraft Shelley was an English novelist who wrote the Gothic novel Frankenstein; or, The Modern Prometheus, which is considered an early example of science fiction.",
      "publishedYear": 1818,
      "totalCopies": 9,
      "availableCopies": 8,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "gothic monster",
      "createdAt": { "seconds": 1715212800, "nanoseconds": 0 }
    },
    {
      "id": "the-lord-of-the-rings-tolkien",
      "title": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "category": "Fantasy",
      "summary": "A shy young hobbit named Frodo Baggins inherits a simple gold ring. He knows the ring has power, but not that he alone holds the secret to the survival—or enslavement—of the entire world. Now Frodo, accompanied by a wizard, an elf, a dwarf, two men and three loyal hobbit friends, must become the greatest hero the world has ever known to save the land and the people he loves.",
      "authorInfo": "John Ronald Reuel Tolkien was an English writer, poet, philologist, and academic, best known as the author of the high fantasy works The Hobbit and The Lord of the Rings.",
      "publishedYear": 1954,
      "totalCopies": 25,
      "availableCopies": 20,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "epic fantasy",
      "createdAt": { "seconds": 1715299200, "nanoseconds": 0 }
    },
    {
      "id": "the-alchemist-coelho",
      "title": "The Alchemist",
      "author": "Paulo Coelho",
      "category": "Fiction",
      "summary": "Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined.",
      "authorInfo": "Paulo Coelho de Souza is a Brazilian lyricist and novelist, best known for his novel The Alchemist. In 2014, he uploaded his personal papers online to create a virtual Paulo Coelho Foundation.",
      "publishedYear": 1988,
      "totalCopies": 30,
      "availableCopies": 22,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "spiritual journey",
      "createdAt": { "seconds": 1715385600, "nanoseconds": 0 }
    },
    {
      "id": "crime-and-punishment-dostoevsky",
      "title": "Crime and Punishment",
      "author": "Fyodor Dostoevsky",
      "category": "Philosophical Fiction",
      "summary": "A psychological drama of a young man, Raskolnikov, an impoverished ex-student in Saint Petersburg who formulates a plan to kill an unscrupulous pawnbroker for her money.",
      "authorInfo": "Fyodor Mikhailovich Dostoevsky, sometimes transliterated as Dostoyevsky, was a Russian novelist, short story writer, essayist, and journalist.",
      "publishedYear": 1866,
      "totalCopies": 6,
      "availableCopies": 1,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "moral dilemma",
      "createdAt": { "seconds": 1715472000, "nanoseconds": 0 }
    },
    {
      "id": "the-adventures-of-huckleberry-finn-twain",
      "title": "The Adventures of Huckleberry Finn",
      "author": "Mark Twain",
      "category": "Adventure",
      "summary": "A tale of a boy's journey down the Mississippi River on a raft with a runaway slave. It is a satire on entrenched attitudes, particularly racism.",
      "authorInfo": "Samuel Langhorne Clemens, known by his pen name Mark Twain, was an American writer, humorist, entrepreneur, publisher, and lecturer.",
      "publishedYear": 1884,
      "totalCopies": 11,
      "availableCopies": 11,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "river adventure",
      "createdAt": { "seconds": 1715558400, "nanoseconds": 0 }
    },
    {
      "id": "anna-karenina-tolstoy",
      "title": "Anna Karenina",
      "author": "Leo Tolstoy",
      "category": "Realist Fiction",
      "summary": "Acclaimed by many as the world's greatest novel, Anna Karenina provides a vast panorama of contemporary life in Russia and of humanity in general. In it Tolstoy uses his intense imaginative insight to create some of the most memorable characters in all of literature.",
      "authorInfo": "Count Lev Nikolayevich Tolstoy, usually referred to in English as Leo Tolstoy, was a Russian writer who is regarded as one of the greatest authors of all time.",
      "publishedYear": 1878,
      "totalCopies": 5,
      "availableCopies": 4,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "tragic romance",
      "createdAt": { "seconds": 1715644800, "nanoseconds": 0 }
    },
    {
      "id": "one-hundred-years-of-solitude-marquez",
      "title": "One Hundred Years of Solitude",
      "author": "Gabriel Garcia Marquez",
      "category": "Magical Realism",
      "summary": "The story of the rise and fall, birth and death of the mythical town of Macondo through the history of the Buendía family.",
      "authorInfo": "Gabriel José de la Concordia García Márquez was a Colombian novelist, short-story writer, screenwriter, and journalist, known affectionately as Gabo or Gabito throughout Latin America.",
      "publishedYear": 1967,
      "totalCopies": 8,
      "availableCopies": 6,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "family saga",
      "createdAt": { "seconds": 1715731200, "nanoseconds": 0 }
    },
    {
      "id": "the-picture-of-dorian-gray-wilde",
      "title": "The Picture of Dorian Gray",
      "author": "Oscar Wilde",
      "category": "Gothic Fiction",
      "summary": "The novel tells of a young man named Dorian Gray, the subject of a painting by artist Basil Hallward. Basil is impressed by Dorian's beauty and becomes infatuated with him, believing his beauty is responsible for a new mode in his art.",
      "authorInfo": "Oscar Fingal O'Flahertie Wills Wilde was an Irish poet and playwright. After writing in different forms throughout the 1880s, the early 1890s saw him become one of London's most popular playwrights.",
      "publishedYear": 1890,
      "totalCopies": 7,
      "availableCopies": 7,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "haunted portrait",
      "createdAt": { "seconds": 1715817600, "nanoseconds": 0 }
    },
    {
      "id": "fahrenheit-451-bradbury",
      "title": "Fahrenheit 451",
      "author": "Ray Bradbury",
      "category": "Dystopian",
      "summary": "A dystopian novel about a future American society where books are outlawed and 'firemen' burn any that are found. The story follows Guy Montag, a fireman who becomes disillusioned with his role of censoring literature and destroying knowledge.",
      "authorInfo": "Ray Douglas Bradbury was an American author and screenwriter. He worked in a variety of genres, including fantasy, science fiction, horror, and mystery fiction.",
      "publishedYear": 1953,
      "totalCopies": 14,
      "availableCopies": 9,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "book burning",
      "createdAt": { "seconds": 1715904000, "nanoseconds": 0 }
    },
    {
      "id": "foundation-asimov",
      "title": "Foundation",
      "author": "Isaac Asimov",
      "category": "Sci-Fi",
      "summary": "The first novel in Isaac Asimov's classic science-fiction saga, Foundation, introduces Hari Seldon, a psychohistorian who can scientifically predict the future. Foreseeing the fall of the Galactic Empire, Seldon establishes a foundation of scholars to preserve knowledge and shorten the ensuing dark age.",
      "authorInfo": "Isaac Asimov was an American writer and professor of biochemistry at Boston University. He was known for his works of science fiction and popular science.",
      "publishedYear": 1951,
      "totalCopies": 10,
      "availableCopies": 8,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "galactic empire",
      "createdAt": { "seconds": 1715990400, "nanoseconds": 0 }
    },
    {
      "id": "sapiens-harari",
      "title": "Sapiens: A Brief History of Humankind",
      "author": "Yuval Noah Harari",
      "category": "Non-Fiction",
      "summary": "A groundbreaking narrative of humanity’s creation and evolution—a #1 international bestseller that explores the ways in which biology and history have defined us and enhanced our understanding of what it means to be 'human.'",
      "authorInfo": "Yuval Noah Harari is an Israeli public intellectual, historian and a professor in the Department of History at the Hebrew University of Jerusalem.",
      "publishedYear": 2011,
      "totalCopies": 15,
      "availableCopies": 13,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "human history",
      "createdAt": { "seconds": 1716076800, "nanoseconds": 0 }
    },
    {
      "id": "the-martian-weir",
      "title": "The Martian",
      "author": "Andy Weir",
      "category": "Sci-Fi",
      "summary": "After a fierce storm, astronaut Mark Watney is presumed dead and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit, and spirit to subsist and find a way to signal to Earth that he is alive.",
      "authorInfo": "Andrew Taylor Weir is an American novelist and former computer programmer. His 2011 novel The Martian was adapted into the 2015 film of the same name directed by Ridley Scott.",
      "publishedYear": 2011,
      "totalCopies": 12,
      "availableCopies": 10,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "stranded astronaut",
      "createdAt": { "seconds": 1716163200, "nanoseconds": 0 }
    },
    {
      "id": "the-hitchhikers-guide-to-the-galaxy-adams",
      "title": "The Hitchhiker's Guide to the Galaxy",
      "author": "Douglas Adams",
      "category": "Sci-Fi",
      "summary": "Seconds before the Earth is demolished to make way for a galactic freeway, Arthur Dent is plucked off the planet by his friend Ford Prefect, a researcher for the revised edition of The Hitchhiker's Guide to the Galaxy who, for the last fifteen years, has been posing as an out-of-work actor.",
      "authorInfo": "Douglas Noel Adams was an English author, screenwriter, essayist, humorist, satirist and dramatist. Adams was author of The Hitchhiker's Guide to the Galaxy, which originated in 1978 as a BBC radio comedy.",
      "publishedYear": 1979,
      "totalCopies": 18,
      "availableCopies": 17,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "space comedy",
      "createdAt": { "seconds": 1716249600, "nanoseconds": 0 }
    }
]
