
[
    {
      "id": "dune-herbert",
      "title": "Dune",
      "author": "Frank Herbert",
      "category": "Sci-Fi",
      "summary": "Dune tells the story of young Paul Atreides, whose family accepts the stewardship of the desert planet Arrakis. As this planet is the only source of the 'spice' melange, the most valuable substance in the universe, control of Arrakis is a coveted — and dangerous — undertaking.",
      "authorInfo": "Franklin Patrick Herbert Jr. was an American science-fiction author best known for the 1965 novel Dune and its five sequels. Though he became famous for his novels, he also wrote short stories and worked as a newspaper journalist, photographer, book reviewer, ecological consultant, and lecturer.",
      "publishedYear": 1965,
      "totalCopies": 10,
      "availableCopies": 7,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "noble families",
      "createdAt": { "seconds": 1714348800, "nanoseconds": 0 }
    },
    {
        "id": "the-hobbit-tolkien",
        "title": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "category": "Fantasy",
        "summary": "The Hobbit is a tale of high adventure, undertaken by a company of dwarves in search of dragon-guarded gold. A reluctant partner in this perilous quest is Bilbo Baggins, a comfort-loving, unambitious hobbit, who surprises even himself by his resourcefulness and skill as a burglar.",
        "authorInfo": "John Ronald Reuel Tolkien was an English writer, poet, philologist, and academic, best known as the author of the high fantasy works The Hobbit and The Lord of the Rings.",
        "publishedYear": 1937,
        "totalCopies": 12,
        "availableCopies": 9,
        "coverUrl": "https://firebasestudio.googleapis.com/v0/b/app-hosting-project.appspot.com/o/images%2Fa954f9a1-00cc-40b9-873b-f6bd7a477380?alt=media&token=8e244670-3544-48f8-b18a-f529e71e98d9",
        "hint": "fantasy adventure",
        "createdAt": { "seconds": 1714435200, "nanoseconds": 0 }
    },
    {
      "id": "brave-new-world-huxley",
      "title": "Brave New World",
      "author": "Aldous Huxley",
      "category": "Dystopian",
      "summary": "Brave New World is a dystopian novel by English author Aldous Huxley, written in 1931 and published in 1932. Largely set in a futuristic World State, whose citizens are environmentally engineered into an intelligence-based social hierarchy, the novel anticipates huge scientific advancements in reproductive technology, sleep-learning, psychological manipulation and classical conditioning that are combined to make a dystopian society which is challenged by only a single individual: the story's protagonist.",
      "authorInfo": "Aldous Leonard Huxley was an English writer and philosopher. He wrote nearly 50 books—both novels and non-fiction works—as well as wide-ranging essays, narratives, and poems.",
      "publishedYear": 1932,
      "totalCopies": 8,
      "availableCopies": 5,
      "coverUrl": "https://storage.googleapis.com/maker-me/uploads/2024-08-01/a038f4d8-7440-42b7-a3ed-28ef782013f9.jpeg",
      "hint": "futuristic society",
      "createdAt": { "seconds": 1714521600, "nanoseconds": 0 }
    }
]
