
[
    {
      "id": "dune-herbert",
      "title": "Dune",
      "author": "Frank Herbert",
      "category": "Sci-Fi",
      "summary": "Dune tells the story of young Paul Atreides, whose family accepts the stewardship of the desert planet Arrakis. As this planet is the only source of the 'spice' melange, the most valuable substance in the universe, control of Arrakis is a coveted — and dangerous — undertaking.",
      "authorInfo": "Franklin Patrick Herbert Jr. was an American science-fiction author best known for the 1965 novel Dune and its five sequels. Though he became famous for his novels, he also wrote short stories and worked as a newspaper journalist, photographer, book reviewer, ecological consultant, and lecturer.",
      "publishedYear": 1965,
      "totalCopies": 10,
      "availableCopies": 7,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "desert planet",
      "createdAt": { "seconds": 1672531200, "nanoseconds": 0 }
    },
    {
      "id": "foundation-asimov",
      "title": "Foundation",
      "author": "Isaac Asimov",
      "category": "Sci-Fi",
      "summary": "The first novel in Isaac Asimov's classic science-fiction masterpiece, the Foundation series, which inspired the Apple TV+ series Foundation. When the Galactic Empire collapses, psychohistorian Hari Seldon's prophecy of a 30,000-year Dark Age is the only thing that can save humanity.",
      "authorInfo": "Isaac Asimov was an American writer and professor of biochemistry at Boston University. During his lifetime, Asimov was considered one of the 'Big Three' science fiction writers, along with Robert A. Heinlein and Arthur C. Clarke.",
      "publishedYear": 1951,
      "totalCopies": 8,
      "availableCopies": 8,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "galactic empire",
      "createdAt": { "seconds": 1675209600, "nanoseconds": 0 }
    },
    {
        "id": "brave-new-world-huxley",
        "title": "Brave New World",
        "author": "Aldous Huxley",
        "category": "Dystopian",
        "summary": "A dystopian novel which presents a futuristic World State of genetically modified citizens and an intelligence-based social hierarchy. The novel anticipates huge scientific advancements in reproductive technology, sleep-learning, psychological manipulation, and classical conditioning that are combined to make a utopian society which is challenged by only a single individual: the story's protagonist.",
        "authorInfo": "Aldous Leonard Huxley was an English writer and philosopher. He wrote nearly 50 books—both novels and non-fiction works—as well as wide-ranging essays, narratives, and poems.",
        "publishedYear": 1932,
        "totalCopies": 12,
        "availableCopies": 12,
        "coverUrl": "https://placehold.co/400x600.png",
        "hint": "dystopian society",
        "createdAt": { "seconds": 1677628800, "nanoseconds": 0 }
    },
    {
      "id": "1984-orwell",
      "title": "1984",
      "author": "George Orwell",
      "category": "Dystopian",
      "summary": "A dystopian social science fiction novel and cautionary tale. It tells the story of Winston Smith, a low-ranking member of the ruling Party in London, in the nation of Oceania. Everything that Winston does is scrutinized by the Party, which is led by a mysterious figure called Big Brother.",
      "authorInfo": "Eric Arthur Blair, better known by his pen name George Orwell, was an English novelist, essayist, journalist, and critic. His work is characterized by lucid prose, social criticism, opposition to totalitarianism, and support of democratic socialism.",
      "publishedYear": 1949,
      "totalCopies": 15,
      "availableCopies": 11,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "big brother",
      "createdAt": { "seconds": 1680307200, "nanoseconds": 0 }
    },
    {
      "id": "hobbit-tolkien",
      "title": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "category": "Fantasy",
      "summary": "The Hobbit follows the quest of home-loving Bilbo Baggins to win a share of the treasure guarded by Smaug the dragon. Bilbo's journey takes him from his comfortable, unambitious life in Hobbiton into more sinister territory.",
      "authorInfo": "John Ronald Reuel Tolkien was an English writer, poet, philologist, and academic, who is best known as the author of the classic high fantasy works The Hobbit, The Lord of the Rings, and The Silmarillion.",
      "publishedYear": 1937,
      "totalCopies": 20,
      "availableCopies": 20,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "fantasy quest",
      "createdAt": { "seconds": 1682899200, "nanoseconds": 0 }
    },
    {
      "id": "mockingbird-lee",
      "title": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "category": "Classic Literature",
      "summary": "The story of a young girl, Scout Finch, her brother, Jem, and their father, Atticus, a lawyer who defends a black man falsely accused of a grave crime. The novel explores themes of racial injustice and the loss of innocence.",
      "authorInfo": "Nelle Harper Lee was an American novelist best known for her 1960 novel To Kill a Mockingbird. It won the 1961 Pulitzer Prize and has become a classic of modern American literature.",
      "publishedYear": 1960,
      "totalCopies": 18,
      "availableCopies": 15,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "racial injustice",
      "createdAt": { "seconds": 1685577600, "nanoseconds": 0 }
    },
    {
        "id": "gatsby-fitzgerald",
        "title": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "category": "Classic Literature",
        "summary": "Set in the Jazz Age on Long Island, near New York City, the novel depicts first-person narrator Nick Carraway's interactions with mysterious millionaire Jay Gatsby and Gatsby's obsession to reunite with his former lover, Daisy Buchanan.",
        "authorInfo": "Francis Scott Key Fitzgerald was an American novelist, essayist, and short story writer. He is best known for his novels depicting the flamboyance and excess of the Jazz Age.",
        "publishedYear": 1925,
        "totalCopies": 14,
        "availableCopies": 14,
        "coverUrl": "https://placehold.co/400x600.png",
        "hint": "jazz age",
        "createdAt": { "seconds": 1688169600, "nanoseconds": 0 }
    },
    {
        "id": "catcher-rye-salinger",
        "title": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "category": "Classic Literature",
        "summary": "The novel details two days in the life of 16-year-old Holden Caulfield after he has been expelled from prep school. Confused and disillusioned, Holden searches for truth and rails against the 'phoniness' of the adult world.",
        "authorInfo": "Jerome David Salinger was an American writer best known for his 1951 novel The Catcher in the Rye.",
        "publishedYear": 1951,
        "totalCopies": 16,
        "availableCopies": 10,
        "coverUrl": "https://placehold.co/400x600.png",
        "hint": "teenage angst",
        "createdAt": { "seconds": 1690848000, "nanoseconds": 0 }
    },
    {
        "id": "pride-prejudice-austen",
        "title": "Pride and Prejudice",
        "author": "Jane Austen",
        "category": "Classic Literature",
        "summary": "This classic novel follows the turbulent relationship between Elizabeth Bennet, the daughter of a country gentleman, and Fitzwilliam Darcy, a rich aristocratic landowner. They must overcome the titular sins of pride and prejudice in order to fall in love and marry.",
        "authorInfo": "Jane Austen was an English novelist known primarily for her six major novels, which interpret, critique, and comment upon the British landed gentry at the end of the 18th century.",
        "publishedYear": 1813,
        "totalCopies": 25,
        "availableCopies": 25,
        "coverUrl": "https://placehold.co/400x600.png",
        "hint": "romantic novel",
        "createdAt": { "seconds": 1693526400, "nanoseconds": 0 }
    },
    {
        "id": "fahrenheit-451-bradbury",
        "title": "Fahrenheit 451",
        "author": "Ray Bradbury",
        "category": "Dystopian",
        "summary": "A dystopian novel presenting a future American society where books are outlawed and 'firemen' burn any that are found. The story follows Guy Montag, a fireman who becomes disillusioned with his role of censoring literature and destroying knowledge, eventually quitting his job and joining a resistance group.",
        "authorInfo": "Ray Douglas Bradbury was an American author and screenwriter. One of the most celebrated 20th-century American writers, he worked in a variety of modes, including fantasy, science fiction, horror, mystery, and realistic fiction.",
        "publishedYear": 1953,
        "totalCopies": 11,
        "availableCopies": 9,
        "coverUrl": "https://placehold.co/400x600.png",
        "hint": "book burning",
        "createdAt": { "seconds": 1696118400, "nanoseconds": 0 }
    }
]
