

[
    {
      "id": "dune-herbert",
      "title": "Dune",
      "author": "Frank Herbert",
      "category": "Sci-Fi",
      "summary": "Dune tells the story of young Paul Atreides, whose family accepts the stewardship of the desert planet Arrakis. As this planet is the only source of the 'spice' melange, the most valuable substance in the universe, control of Arrakis is a coveted — and dangerous — undertaking.",
      "authorInfo": "Franklin Patrick Herbert Jr. was an American science-fiction author best known for the 1965 novel Dune and its five sequels. Though he became famous for his novels, he also wrote short stories and worked as a newspaper journalist, photographer, book reviewer, ecological consultant, and lecturer.",
      "publishedYear": 1965,
      "totalCopies": 10,
      "availableCopies": 7,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "desert planet",
      "createdAt": { "seconds": 1672531200, "nanoseconds": 0 }
    },
    {
      "id": "foundation-asimov",
      "title": "Foundation",
      "author": "Isaac Asimov",
      "category": "Sci-Fi",
      "summary": "The first novel in Isaac Asimov's classic science-fiction masterpiece, the Foundation series, which inspired the Apple TV+ series Foundation. When the Galactic Empire collapses, psychohistorian Hari Seldon's prophecy of a 30,000-year Dark Age is the only thing that can save humanity.",
      "authorInfo": "Isaac Asimov was an American writer and professor of biochemistry at Boston University. During his lifetime, Asimov was considered one of the 'Big Three' science fiction writers, along with Robert A. Heinlein and Arthur C. Clarke.",
      "publishedYear": 1951,
      "totalCopies": 8,
      "availableCopies": 8,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "galactic empire",
      "createdAt": { "seconds": 1675209600, "nanoseconds": 0 }
    },
    {
        "id": "brave-new-world-huxley",
        "title": "Brave New World",
        "author": "Aldous Huxley",
        "category": "Dystopian",
        "summary": "A dystopian novel which presents a futuristic World State of genetically modified citizens and an intelligence-based social hierarchy. The novel anticipates huge scientific advancements in reproductive technology, sleep-learning, psychological manipulation, and classical conditioning that are combined to make a utopian society which is challenged by only a single individual: the story's protagonist.",
        "authorInfo": "Aldous Leonard Huxley was an English writer and philosopher. He wrote nearly 50 books—both novels and non-fiction works—as well as wide-ranging essays, narratives, and poems.",
        "publishedYear": 1932,
        "totalCopies": 12,
        "availableCopies": 12,
        "coverUrl": "https://placehold.co/400x600.png",
        "hint": "dystopian society",
        "createdAt": { "seconds": 1677628800, "nanoseconds": 0 }
    },
    {
      "id": "1984-orwell",
      "title": "1984",
      "author": "George Orwell",
      "category": "Dystopian",
      "summary": "A dystopian social science fiction novel and cautionary tale. It tells the story of Winston Smith, a low-ranking member of the ruling Party in London, in the nation of Oceania. Everything that Winston does is scrutinized by the Party, which is led by a mysterious figure called Big Brother.",
      "authorInfo": "Eric Arthur Blair, better known by his pen name George Orwell, was an English novelist, essayist, journalist, and critic. His work is characterized by lucid prose, social criticism, opposition to totalitarianism, and support of democratic socialism.",
      "publishedYear": 1949,
      "totalCopies": 15,
      "availableCopies": 11,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "big brother",
      "createdAt": { "seconds": 1680307200, "nanoseconds": 0 }
    },
    {
      "id": "hobbit-tolkien",
      "title": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "category": "Fantasy",
      "summary": "The Hobbit follows the quest of home-loving Bilbo Baggins to win a share of the treasure guarded by Smaug the dragon. Bilbo's journey takes him from his comfortable, unambitious life in Hobbiton into more sinister territory.",
      "authorInfo": "John Ronald Reuel Tolkien was an English writer, poet, philologist, and academic, who is best known as the author of the classic high fantasy works The Hobbit, The Lord of the Rings, and The Silmarillion.",
      "publishedYear": 1937,
      "totalCopies": 20,
      "availableCopies": 20,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "fantasy quest",
      "createdAt": { "seconds": 1682899200, "nanoseconds": 0 }
    },
    {
      "id": "mockingbird-lee",
      "title": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "category": "Classic Literature",
      "summary": "The story of a young girl, Scout Finch, her brother, Jem, and their father, Atticus, a lawyer who defends a black man falsely accused of a grave crime. The novel explores themes of racial injustice and the loss of innocence.",
      "authorInfo": "Nelle Harper Lee was an American novelist best known for her 1960 novel To Kill a Mockingbird. It won the 1961 Pulitzer Prize and has become a classic of modern American literature.",
      "publishedYear": 1960,
      "totalCopies": 18,
      "availableCopies": 15,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "racial injustice",
      "createdAt": { "seconds": 1685577600, "nanoseconds": 0 }
    },
    {
        "id": "gatsby-fitzgerald",
        "title": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "category": "Classic Literature",
        "summary": "Set in the Jazz Age on Long Island, near New York City, the novel depicts first-person narrator Nick Carraway's interactions with mysterious millionaire Jay Gatsby and Gatsby's obsession to reunite with his former lover, Daisy Buchanan.",
        "authorInfo": "Francis Scott Key Fitzgerald was an American novelist, essayist, and short story writer. He is best known for his novels depicting the flamboyance and excess of the Jazz Age.",
        "publishedYear": 1925,
        "totalCopies": 14,
        "availableCopies": 14,
        "coverUrl": "https://placehold.co/400x600.png",
        "hint": "jazz age",
        "createdAt": { "seconds": 1688169600, "nanoseconds": 0 }
    },
    {
        "id": "catcher-rye-salinger",
        "title": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "category": "Classic Literature",
        "summary": "The novel details two days in the life of 16-year-old Holden Caulfield after he has been expelled from prep school. Confused and disillusioned, Holden searches for truth and rails against the 'phoniness' of the adult world.",
        "authorInfo": "Jerome David Salinger was an American writer best known for his 1951 novel The Catcher in the Rye.",
        "publishedYear": 1951,
        "totalCopies": 16,
        "availableCopies": 10,
        "coverUrl": "https://placehold.co/400x600.png",
        "hint": "teenage angst",
        "createdAt": { "seconds": 1690848000, "nanoseconds": 0 }
    },
    {
        "id": "pride-prejudice-austen",
        "title": "Pride and Prejudice",
        "author": "Jane Austen",
        "category": "Classic Literature",
        "summary": "This classic novel follows the turbulent relationship between Elizabeth Bennet, the daughter of a country gentleman, and Fitzwilliam Darcy, a rich aristocratic landowner. They must overcome the titular sins of pride and prejudice in order to fall in love and marry.",
        "authorInfo": "Jane Austen was an English novelist known primarily for her six major novels, which interpret, critique, and comment upon the British landed gentry at the end of the 18th century.",
        "publishedYear": 1813,
        "totalCopies": 25,
        "availableCopies": 25,
        "coverUrl": "https://placehold.co/400x600.png",
        "hint": "romantic novel",
        "createdAt": { "seconds": 1693526400, "nanoseconds": 0 }
    },
    {
        "id": "fahrenheit-451-bradbury",
        "title": "Fahrenheit 451",
        "author": "Ray Bradbury",
        "category": "Dystopian",
        "summary": "A dystopian novel presenting a future American society where books are outlawed and 'firemen' burn any that are found. The story follows Guy Montag, a fireman who becomes disillusioned with his role of censoring literature and destroying knowledge, eventually quitting his job and joining a resistance group.",
        "authorInfo": "Ray Douglas Bradbury was an American author and screenwriter. One of the most celebrated 20th-century American writers, he worked in a variety of modes, including fantasy, science fiction, horror, mystery, and realistic fiction.",
        "publishedYear": 1953,
        "totalCopies": 11,
        "availableCopies": 9,
        "coverUrl": "https://placehold.co/400x600.png",
        "hint": "book burning",
        "createdAt": { "seconds": 1696118400, "nanoseconds": 0 }
    },
    {
      "id": "enders-game-card",
      "title": "Ender's Game",
      "author": "Orson Scott Card",
      "category": "Sci-Fi",
      "summary": "In a future where humanity is at war with an alien race, gifted children are trained from a young age to become military commanders. The story follows Andrew 'Ender' Wiggin, a brilliant young boy who is drafted into Battle School.",
      "authorInfo": "Orson Scott Card is an American writer known best for his science fiction works. His novel Ender's Game (1985) and its sequel Speaker for the Dead (1986) both won Hugo and Nebula Awards.",
      "publishedYear": 1985,
      "totalCopies": 15,
      "availableCopies": 12,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "space battle",
      "createdAt": { "seconds": 1698710400, "nanoseconds": 0 }
    },
    {
      "id": "lord-of-the-rings-tolkien",
      "title": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "category": "Fantasy",
      "summary": "A high-fantasy epic that follows the quest of the hobbit Frodo Baggins to destroy the One Ring, a powerful artifact created by the Dark Lord Sauron. Frodo and his companions must journey to Mordor, the only place where the Ring can be destroyed.",
      "authorInfo": "John Ronald Reuel Tolkien was an English writer, poet, philologist, and academic, best known for The Hobbit and The Lord of the Rings.",
      "publishedYear": 1954,
      "totalCopies": 25,
      "availableCopies": 20,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "epic fantasy",
      "createdAt": { "seconds": 1701302400, "nanoseconds": 0 }
    },
    {
      "id": "moby-dick-melville",
      "title": "Moby Dick",
      "author": "Herman Melville",
      "category": "Classic Literature",
      "summary": "The narrative of sailor Ishmael's obsessive quest of Ahab, captain of the whaling ship Pequod, for revenge on Moby Dick, the giant white sperm whale that on the ship's previous voyage bit off Ahab's leg at the knee.",
      "authorInfo": "Herman Melville was an American novelist, short story writer, and poet of the American Renaissance period. Among his best-known works are Moby-Dick (1851), Typee (1846), a romanticized account of his experiences in Polynesia, and Billy Budd, Sailor, a posthumously published novella.",
      "publishedYear": 1851,
      "totalCopies": 10,
      "availableCopies": 8,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "whaling ship",
      "createdAt": { "seconds": 1703894400, "nanoseconds": 0 }
    },
    {
      "id": "war-and-peace-tolstoy",
      "title": "War and Peace",
      "author": "Leo Tolstoy",
      "category": "Classic Literature",
      "summary": "A historical novel that chronicles the history of the French invasion of Russia and the impact of the Napoleonic era on Tsarist society through the stories of five Russian aristocratic families.",
      "authorInfo": "Count Lev Nikolayevich Tolstoy, usually referred to in English as Leo Tolstoy, was a Russian writer who is regarded as one of the greatest authors of all time.",
      "publishedYear": 1869,
      "totalCopies": 8,
      "availableCopies": 5,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "historical epic",
      "createdAt": { "seconds": 1706486400, "nanoseconds": 0 }
    },
    {
      "id": "the-handmaids-tale-atwood",
      "title": "The Handmaid's Tale",
      "author": "Margaret Atwood",
      "category": "Dystopian",
      "summary": "Set in a near-future New England, in a totalitarian state resembling a theonomy, the novel explores themes of subjugated women in a patriarchal society and the various means by which they resist and attempt to gain individuality and independence.",
      "authorInfo": "Margaret Eleanor Atwood is a Canadian poet, novelist, literary critic, essayist, teacher, environmental activist, and inventor. Since 1961, she has published 18 books of poetry, 18 novels, 11 books of non-fiction, nine collections of short fiction, eight children's books, and two graphic novels, as well as a number of small press editions of both poetry and fiction.",
      "publishedYear": 1985,
      "totalCopies": 18,
      "availableCopies": 15,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "patriarchal society",
      "createdAt": { "seconds": 1709078400, "nanoseconds": 0 }
    },
    {
      "id": "neuromancer-gibson",
      "title": "Neuromancer",
      "author": "William Gibson",
      "category": "Sci-Fi",
      "summary": "A seminal work in the cyberpunk genre, the novel follows Henry Dorsett Case, a washed-up computer hacker who is hired by a mysterious employer to pull off the ultimate hack.",
      "authorInfo": "William Ford Gibson is an American-Canadian speculative fiction writer and essayist widely credited with pioneering the science fiction subgenre known as cyberpunk.",
      "publishedYear": 1984,
      "totalCopies": 12,
      "availableCopies": 10,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "cyberpunk hacker",
      "createdAt": { "seconds": 1711670400, "nanoseconds": 0 }
    },
    {
      "id": "a-game-of-thrones-martin",
      "title": "A Game of Thrones",
      "author": "George R.R. Martin",
      "category": "Fantasy",
      "summary": "The first book in A Song of Ice and Fire, a series of epic fantasy novels. The story takes place on the fictional continents of Westeros and Essos and chronicles the power struggles among noble families as they vie for control of the Iron Throne of the Seven Kingdoms.",
      "authorInfo": "George Raymond Richard Martin, also known as GRRM, is an American novelist and short-story writer in the fantasy, horror, and science fiction genres, a screenwriter, and television producer.",
      "publishedYear": 1996,
      "totalCopies": 30,
      "availableCopies": 25,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "iron throne",
      "createdAt": { "seconds": 1714262400, "nanoseconds": 0 }
    },
    {
      "id": "the-alchemist-coelho",
      "title": "The Alchemist",
      "author": "Paulo Coelho",
      "category": "Fiction",
      "summary": "An allegorical novel that tells the story of Santiago, an Andalusian shepherd boy who dreams of a treasure in Egypt. The book is an exploration of personal legends and the pursuit of one's destiny.",
      "authorInfo": "Paulo Coelho de Souza is a Brazilian lyricist and novelist, best known for his novel The Alchemist. In 2014, he uploaded his personal papers online to create a virtual Paulo Coelho Foundation.",
      "publishedYear": 1988,
      "totalCopies": 22,
      "availableCopies": 18,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "spiritual journey",
      "createdAt": { "seconds": 1716854400, "nanoseconds": 0 }
    },
    {
      "id": "sapiens-harari",
      "title": "Sapiens: A Brief History of Humankind",
      "author": "Yuval Noah Harari",
      "category": "Non-Fiction",
      "summary": "A book that surveys the history of humankind, from the stone age to the twenty-first century. The author explores how Homo sapiens came to dominate the world and the major revolutions that have shaped human societies.",
      "authorInfo": "Yuval Noah Harari is an Israeli public intellectual, historian and a professor in the Department of History at the Hebrew University of Jerusalem.",
      "publishedYear": 2011,
      "totalCopies": 18,
      "availableCopies": 18,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "human history",
      "createdAt": { "seconds": 1719446400, "nanoseconds": 0 }
    },
    {
      "id": "the-martian-weir",
      "title": "The Martian",
      "author": "Andy Weir",
      "category": "Sci-Fi",
      "summary": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet.",
      "authorInfo": "Andrew Taylor Weir is an American novelist and former computer programmer. His 2011 novel The Martian was adapted into the 2015 film of the same name directed by Ridley Scott.",
      "publishedYear": 2011,
      "totalCopies": 16,
      "availableCopies": 13,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "mars survival",
      "createdAt": { "seconds": 1722038400, "nanoseconds": 0 }
    },
    {
      "id": "crime-and-punishment-dostoevsky",
      "title": "Crime and Punishment",
      "author": "Fyodor Dostoevsky",
      "category": "Classic Literature",
      "summary": "A novel that focuses on the mental anguish and moral dilemmas of Rodion Raskolnikov, an impoverished ex-student in Saint Petersburg who formulates a plan to kill an unscrupulous pawnbroker for her money.",
      "authorInfo": "Fyodor Mikhailovich Dostoevsky, sometimes transliterated as Dostoyevsky, was a Russian novelist, short story writer, essayist, and journalist.",
      "publishedYear": 1866,
      "totalCopies": 10,
      "availableCopies": 9,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "moral dilemma",
      "createdAt": { "seconds": 1724630400, "nanoseconds": 0 }
    },
    {
      "id": "hitchhikers-guide-adams",
      "title": "The Hitchhiker's Guide to the Galaxy",
      "author": "Douglas Adams",
      "category": "Sci-Fi",
      "summary": "A comedic science fiction series that follows the misadventures of the last surviving man, Arthur Dent, following the demolition of the Earth by a Vogon constructor fleet to make way for a hyperspace bypass.",
      "authorInfo": "Douglas Noel Adams was an English author, screenwriter, essayist, humorist, satirist and dramatist. Adams was an advocate for environmentalism and conservation, a lover of fast cars, technological innovation, and the Apple Macintosh, and a self-proclaimed 'radical atheist'.",
      "publishedYear": 1979,
      "totalCopies": 20,
      "availableCopies": 17,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "space comedy",
      "createdAt": { "seconds": 1727222400, "nanoseconds": 0 }
    },
    {
      "id": "the-name-of-the-wind-rothfuss",
      "title": "The Name of the Wind",
      "author": "Patrick Rothfuss",
      "category": "Fantasy",
      "summary": "The first book in The Kingkiller Chronicle series, this novel is an autobiographical account of a magically gifted young man named Kvothe. It follows his journey from a troupe of traveling players to a student at the University.",
      "authorInfo": "Patrick James Rothfuss is an American writer of epic fantasy. He is best known for his projected trilogy The Kingkiller Chronicle, which has won him several awards, including the 2007 Quill Award for his debut novel, The Name of the Wind.",
      "publishedYear": 2007,
      "totalCopies": 28,
      "availableCopies": 22,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "epic fantasy",
      "createdAt": { "seconds": 1729814400, "nanoseconds": 0 }
    },
    {
      "id": "anna-karenina-tolstoy",
      "title": "Anna Karenina",
      "author": "Leo Tolstoy",
      "category": "Classic Literature",
      "summary": "A complex novel in eight parts, with more than a dozen major characters, it is spread over more than 800 pages (depending on the translation), typically in two volumes. It deals with themes of betrayal, faith, family, marriage, Imperial Russian society, desire, and rural vs. city life.",
      "authorInfo": "Count Lev Nikolayevich Tolstoy, usually referred to in English as Leo Tolstoy, was a Russian writer who is regarded as one of the greatest authors of all time.",
      "publishedYear": 1878,
      "totalCopies": 9,
      "availableCopies": 7,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "russian society",
      "createdAt": { "seconds": 1732406400, "nanoseconds": 0 }
    },
    {
      "id": "slaughterhouse-five-vonnegut",
      "title": "Slaughterhouse-Five",
      "author": "Kurt Vonnegut",
      "category": "Sci-Fi",
      "summary": "An anti-war novel that tells the story of Billy Pilgrim, a man who becomes 'unstuck in time' after he is abducted by aliens from the planet Tralfamadore. He experiences events from his past, present, and future in a non-linear fashion.",
      "authorInfo": "Kurt Vonnegut Jr. was an American writer. In a career spanning over 50 years, he published 14 novels, three short story collections, five plays, and five nonfiction works, with further collections being published after his death.",
      "publishedYear": 1969,
      "totalCopies": 14,
      "availableCopies": 11,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "anti war",
      "createdAt": { "seconds": 1734998400, "nanoseconds": 0 }
    },
    {
      "id": "the-road-mccarthy",
      "title": "The Road",
      "author": "Cormac McCarthy",
      "category": "Dystopian",
      "summary": "A post-apocalyptic novel that follows a father and his young son over a period of several months, as they journey across a landscape blasted by an unspecified cataclysm that has destroyed most of civilization and, in the intervening years, almost all life on Earth.",
      "authorInfo": "Cormac McCarthy was an American writer who authored twelve novels, two plays, five screenplays and three short stories, spanning the Western and post-apocalyptic genres.",
      "publishedYear": 2006,
      "totalCopies": 13,
      "availableCopies": 10,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "post apocalyptic",
      "createdAt": { "seconds": 1737590400, "nanoseconds": 0 }
    },
    {
      "id": "one-hundred-years-of-solitude-marquez",
      "title": "One Hundred Years of Solitude",
      "author": "Gabriel Garcia Marquez",
      "category": "Fiction",
      "summary": "The multi-generational story of the Buendía family, whose patriarch, José Arcadio Buendía, founds the town of Macondo. The novel is often cited as one of the supreme achievements in literature.",
      "authorInfo": "Gabriel José de la Concordia García Márquez was a Colombian novelist, short-story writer, screenwriter, and journalist, known affectionately as Gabo or Gabito throughout Latin America.",
      "publishedYear": 1967,
      "totalCopies": 17,
      "availableCopies": 14,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "magical realism",
      "createdAt": { "seconds": 1740182400, "nanoseconds": 0 }
    },
    {
      "id": "educated-westover",
      "title": "Educated: A Memoir",
      "author": "Tara Westover",
      "category": "Non-Fiction",
      "summary": "A memoir that describes the author's upbringing in a survivalist family in rural Idaho and her subsequent journey to higher education. Westover's story is a testament to the power of education to transform lives.",
      "authorInfo": "Tara Westover is an American memoirist, essayist and historian. Her memoir Educated (2018) debuted at No. 1 on The New York Times bestseller list and was a finalist for a number of national awards, including the Los Angeles Times Book Prize, PEN America's Jean Stein Book Award, and two awards from the National Book Critics Circle.",
      "publishedYear": 2018,
      "totalCopies": 19,
      "availableCopies": 19,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "inspiring memoir",
      "createdAt": { "seconds": 1742774400, "nanoseconds": 0 }
    },
    {
      "id": "the-shining-king",
      "title": "The Shining",
      "author": "Stephen King",
      "category": "Thriller",
      "summary": "A horror novel about aspiring writer and recovering alcoholic Jack Torrance, who accepts a position as the off-season caretaker of the isolated historic Overlook Hotel in the Colorado Rockies.",
      "authorInfo": "Stephen Edwin King is an American author of horror, supernatural fiction, suspense, crime, science-fiction, and fantasy novels.",
      "publishedYear": 1977,
      "totalCopies": 20,
      "availableCopies": 16,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "horror novel",
      "createdAt": { "seconds": 1745366400, "nanoseconds": 0 }
    },
    {
      "id": "gone-girl-flynn",
      "title": "Gone Girl",
      "author": "Gillian Flynn",
      "category": "Mystery",
      "summary": "A thriller novel that chronicles the events surrounding the mysterious disappearance of Amy Dunne on the day of her fifth wedding anniversary. The story is told from the alternating perspectives of Amy and her husband, Nick.",
      "authorInfo": "Gillian Schieber Flynn is an American writer. Flynn has published three novels, Sharp Objects, Dark Places, and Gone Girl, all three of which have been adapted for film or television.",
      "publishedYear": 2012,
      "totalCopies": 24,
      "availableCopies": 21,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "psychological thriller",
      "createdAt": { "seconds": 1747958400, "nanoseconds": 0 }
    },
    {
      "id": "do-androids-dream-of-electric-sheep-dick",
      "title": "Do Androids Dream of Electric Sheep?",
      "author": "Philip K. Dick",
      "category": "Sci-Fi",
      "summary": "The novel is set in a post-apocalyptic San Francisco, where Earth's life has been greatly damaged by a nuclear global war. Most animal species are endangered or extinct from extreme radiation poisoning, so that owning an animal is now a sign of high social status, and empathetic capacity is a uniquely human trait.",
      "authorInfo": "Philip Kindred Dick was an American writer known for his work in science fiction. He wrote 44 published novels and approximately 121 short stories, most of which appeared in science fiction magazines during his lifetime.",
      "publishedYear": 1968,
      "totalCopies": 11,
      "availableCopies": 9,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "post apocalyptic",
      "createdAt": { "seconds": 1698800000, "nanoseconds": 0 }
    },
    {
      "id": "the-color-purple-walker",
      "title": "The Color Purple",
      "author": "Alice Walker",
      "category": "Fiction",
      "summary": "An epistolary novel that tells the story of Celie, an African-American teenager raised in rural isolation in Georgia, who is abused and oppressed by the men in her life. The novel explores themes of racism, sexism, and violence.",
      "authorInfo": "Alice Malsenior Tallulah-Kate Walker is an American novelist, short story writer, poet, and social activist. In 1982, she became the first African-American woman to win the Pulitzer Prize for Fiction, which she was awarded for her novel The Color Purple.",
      "publishedYear": 1982,
      "totalCopies": 14,
      "availableCopies": 12,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "powerful story",
      "createdAt": { "seconds": 1698886400, "nanoseconds": 0 }
    },
    {
      "id": "the-picture-of-dorian-gray-wilde",
      "title": "The Picture of Dorian Gray",
      "author": "Oscar Wilde",
      "category": "Classic Literature",
      "summary": "A philosophical novel that tells the story of a young man named Dorian Gray, the subject of a painting by artist Basil Hallward. Dorian expresses the desire to sell his soul, to ensure that the picture, rather than he, will age and fade.",
      "authorInfo": "Oscar Fingal O'Flahertie Wills Wilde was an Irish poet and playwright. After writing in different forms throughout the 1880s, the early 1890s saw him become one of the most popular playwrights in London.",
      "publishedYear": 1890,
      "totalCopies": 13,
      "availableCopies": 11,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "philosophical novel",
      "createdAt": { "seconds": 1698972800, "nanoseconds": 0 }
    },
    {
      "id": "frankenstein-shelley",
      "title": "Frankenstein",
      "author": "Mary Shelley",
      "category": "Classic Literature",
      "summary": "The novel tells the story of Victor Frankenstein, a young scientist who creates a sapient creature in an unorthodox scientific experiment. Frankenstein is a classic of Gothic horror and one of the earliest examples of science fiction.",
      "authorInfo": "Mary Wollstonecraft Shelley was an English novelist who wrote the Gothic novel Frankenstein; or, The Modern Prometheus (1818), which is considered an early example of science fiction.",
      "publishedYear": 1818,
      "totalCopies": 15,
      "availableCopies": 14,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "gothic horror",
      "createdAt": { "seconds": 1699059200, "nanoseconds": 0 }
    },
    {
      "id": "the-chronicles-of-narnia-lewis",
      "title": "The Chronicles of Narnia",
      "author": "C.S. Lewis",
      "category": "Fantasy",
      "summary": "A series of seven fantasy novels that transport readers to the magical land of Narnia, a world of talking animals and mythical creatures. The books are a classic of children's literature and have been adapted into several films.",
      "authorInfo": "Clive Staples Lewis was a British writer and lay theologian. He held academic positions in English literature at both Oxford University (Magdalen College, 1925–1954) and Cambridge University (Magdalene College, 1954–1963).",
      "publishedYear": 1950,
      "totalCopies": 22,
      "availableCopies": 20,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "magical world",
      "createdAt": { "seconds": 1699145600, "nanoseconds": 0 }
    },
    {
      "id": "the-stranger-camus",
      "title": "The Stranger",
      "author": "Albert Camus",
      "category": "Fiction",
      "summary": "A philosophical novel that explores themes of absurdism and existentialism. The story follows Meursault, an indifferent French Algerian who, after attending his mother's funeral, apathetically kills an Arab man in French Algiers, whom he does not know.",
      "authorInfo": "Albert Camus was a French philosopher, author, and journalist. He was awarded the 1957 Nobel Prize in Literature at the age of 44, the second-youngest recipient in history.",
      "publishedYear": 1942,
      "totalCopies": 10,
      "availableCopies": 8,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "existential novel",
      "createdAt": { "seconds": 1699232000, "nanoseconds": 0 }
    },
    {
      "id": "thinking-fast-and-slow-kahneman",
      "title": "Thinking, Fast and Slow",
      "author": "Daniel Kahneman",
      "category": "Non-Fiction",
      "summary": "A book that summarizes research that the author conducted over decades, often in collaboration with Amos Tversky. It covers all three phases of his career: his early work concerning cognitive biases, his work on prospect theory, and his later work on happiness.",
      "authorInfo": "Daniel Kahneman is an Israeli-American psychologist and economist notable for his work on the psychology of judgment and decision-making, as well as behavioral economics, for which he was awarded the 2002 Nobel Memorial Prize in Economic Sciences (shared with Amos Tversky).",
      "publishedYear": 2011,
      "totalCopies": 16,
      "availableCopies": 15,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "cognitive psychology",
      "createdAt": { "seconds": 1699318400, "nanoseconds": 0 }
    },
    {
      "id": "the-girl-with-the-dragon-tattoo-larsson",
      "title": "The Girl with the Dragon Tattoo",
      "author": "Stieg Larsson",
      "category": "Mystery",
      "summary": "A psychological thriller that follows Mikael Blomkvist, a journalist who is hired to investigate the disappearance of a wealthy industrialist's niece. He is assisted by Lisbeth Salander, a brilliant but troubled computer hacker.",
      "authorInfo": "Karl Stig-Erland 'Stieg' Larsson was a Swedish journalist and writer. He is best known for writing the Millennium trilogy of crime novels, which were published posthumously, starting in 2005, after he died of a sudden heart attack.",
      "publishedYear": 2005,
      "totalCopies": 25,
      "availableCopies": 22,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "crime novel",
      "createdAt": { "seconds": 1699404800, "nanoseconds": 0 }
    },
    {
      "id": "the-silent-patient-michaelides",
      "title": "The Silent Patient",
      "author": "Alex Michaelides",
      "category": "Thriller",
      "summary": "A psychological thriller about a psychotherapist, Theo Faber, who is obsessed with uncovering the motive of his famous patient, Alicia Berenson, who has gone silent after murdering her husband.",
      "authorInfo": "Alex Michaelides is a British-Cypriot author and screenwriter. His debut novel, the psychological thriller The Silent Patient, was a No. 1 New York Times bestseller and sold in a record 49 countries.",
      "publishedYear": 2019,
      "totalCopies": 21,
      "availableCopies": 18,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "suspenseful thriller",
      "createdAt": { "seconds": 1699491200, "nanoseconds": 0 }
    },
    {
      "id": "hyperion-simmons",
      "title": "Hyperion",
      "author": "Dan Simmons",
      "category": "Sci-Fi",
      "summary": "The first novel in the Hyperion Cantos, this science fiction epic is set in the 29th century and tells the story of seven pilgrims who travel to the world of Hyperion to confront the Shrike, a mysterious and feared creature.",
      "authorInfo": "Dan Simmons is an American writer of science fiction, horror, and fantasy. He is the author of the Hyperion Cantos and other works that span the science fiction, horror, and fantasy genres, sometimes within a single novel.",
      "publishedYear": 1989,
      "totalCopies": 12,
      "availableCopies": 10,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "science fiction",
      "createdAt": { "seconds": 1699577600, "nanoseconds": 0 }
    },
    {
      "id": "mistborn-sanderson",
      "title": "Mistborn: The Final Empire",
      "author": "Brandon Sanderson",
      "category": "Fantasy",
      "summary": "The first book in the Mistborn series, this high-fantasy novel is set in a world where ash falls from the sky and mists cloak the night. The story follows a young street urchin named Vin who discovers she has magical powers.",
      "authorInfo": "Brandon Sanderson is an American author of epic fantasy and science fiction. He is best known for the Cosmere fictional universe, in which most of his fantasy novels, most notably the Mistborn series and The Stormlight Archive, are set.",
      "publishedYear": 2006,
      "totalCopies": 26,
      "availableCopies": 23,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "magic system",
      "createdAt": { "seconds": 1699664000, "nanoseconds": 0 }
    },
    {
      "id": "les-miserables-hugo",
      "title": "Les Misérables",
      "author": "Victor Hugo",
      "category": "Classic Literature",
      "summary": "A historical novel that follows the lives and interactions of several characters, focusing on the struggles of ex-convict Jean Valjean and his experience of redemption.",
      "authorInfo": "Victor Marie Hugo was a French poet, novelist, and dramatist of the Romantic movement. Hugo is considered to be one of the greatest and best-known French writers.",
      "publishedYear": 1862,
      "totalCopies": 11,
      "availableCopies": 9,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "french revolution",
      "createdAt": { "seconds": 1699750400, "nanoseconds": 0 }
    },
    {
      "id": "the-road-less-traveled-peck",
      "title": "The Road Less Traveled",
      "author": "M. Scott Peck",
      "category": "Non-Fiction",
      "summary": "A book that combines psychology and spirituality to offer a path to a more fulfilling life. Peck argues that life is difficult and that the journey to spiritual growth is a long and arduous one.",
      "authorInfo": "Morgan Scott Peck was an American psychiatrist and best-selling author, best known for his first book, The Road Less Traveled, published in 1978.",
      "publishedYear": 1978,
      "totalCopies": 14,
      "availableCopies": 13,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "self help",
      "createdAt": { "seconds": 1699836800, "nanoseconds": 0 }
    },
    {
      "id": "the-kite-runner-hosseini",
      "title": "The Kite Runner",
      "author": "Khaled Hosseini",
      "category": "Fiction",
      "summary": "The story of Amir, a young boy from the Wazir Akbar Khan district of Kabul, whose closest friend is Hassan. The story is set against a backdrop of tumultuous events, from the fall of Afghanistan's monarchy through the Soviet military intervention, the exodus of refugees to Pakistan and the United States, and the rise of the Taliban regime.",
      "authorInfo": "Khaled Hosseini is an Afghan-American novelist, physician, activist, and UNHCR goodwill ambassador. His debut novel, The Kite Runner, was a critical and commercial success; the book and his subsequent novels have all been bestsellers.",
      "publishedYear": 2003,
      "totalCopies": 23,
      "availableCopies": 20,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "friendship story",
      "createdAt": { "seconds": 1699923200, "nanoseconds": 0 }
    },
    {
      "id": "the-da-vinci-code-brown",
      "title": "The Da Vinci Code",
      "author": "Dan Brown",
      "category": "Mystery",
      "summary": "A thriller novel that follows symbologist Robert Langdon and cryptologist Sophie Neveu after a murder in the Louvre Museum in Paris causes them to become involved in a battle between the Priory of Sion and Opus Dei over the possibility of Jesus Christ having been a companion to Mary Magdalene.",
      "authorInfo": "Daniel Gerhard Brown is an American author best known for his thriller novels, including the Robert Langdon series, which includes Angels & Demons, The Da Vinci Code, The Lost Symbol, Inferno, and Origin.",
      "publishedYear": 2003,
      "totalCopies": 28,
      "availableCopies": 25,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "mystery thriller",
      "createdAt": { "seconds": 1700009600, "nanoseconds": 0 }
    },
    {
      "id": "the-stand-king",
      "title": "The Stand",
      "author": "Stephen King",
      "category": "Thriller",
      "summary": "A post-apocalyptic dark fantasy novel that re-works the scenario of his earlier short story, 'Night Surf'. The novel is a story of a pandemic of a weaponized strain of influenza that kills almost the entire world population.",
      "authorInfo": "Stephen Edwin King is an American author of horror, supernatural fiction, suspense, crime, science-fiction, and fantasy novels.",
      "publishedYear": 1978,
      "totalCopies": 18,
      "availableCopies": 15,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "post apocalyptic",
      "createdAt": { "seconds": 1700096000, "nanoseconds": 0 }
    },
    {
      "id": "snow-crash-stephenson",
      "title": "Snow Crash",
      "author": "Neal Stephenson",
      "category": "Sci-Fi",
      "summary": "A science fiction novel that mashes up proto-cyberpunk, history, linguistics, and computer science. The story follows Hiro Protagonist, a hacker and pizza delivery driver for the Mafia, as he navigates a futuristic Los Angeles.",
      "authorInfo": "Neal Town Stephenson is an American writer known for his works of speculative fiction. His novels have been categorized as science fiction, historical fiction, cyberpunk, and 'postcyberpunk'.",
      "publishedYear": 1992,
      "totalCopies": 12,
      "availableCopies": 11,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "cyberpunk future",
      "createdAt": { "seconds": 1700182400, "nanoseconds": 0 }
    },
    {
      "id": "american-gods-gaiman",
      "title": "American Gods",
      "author": "Neil Gaiman",
      "category": "Fantasy",
      "summary": "A fantasy novel that blends Americana, fantasy, and various strands of ancient and modern mythology, all centering on the mysterious and taciturn Shadow. The book follows him as he is released from prison and gets involved in a large-scale conflict between the Old Gods and the New Gods.",
      "authorInfo": "Neil Richard MacKinnon Gaiman is an English author of short fiction, novels, comic books, graphic novels, nonfiction, audio theatre, and films.",
      "publishedYear": 2001,
      "totalCopies": 24,
      "availableCopies": 21,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "modern mythology",
      "createdAt": { "seconds": 1700268800, "nanoseconds": 0 }
    },
    {
      "id": "wuthering-heights-bronte",
      "title": "Wuthering Heights",
      "author": "Emily Brontë",
      "category": "Classic Literature",
      "summary": "A novel of romance and revenge that tells the story of the passionate and destructive love between Catherine Earnshaw and Heathcliff, and its impact on the lives of their families and descendants.",
      "authorInfo": "Emily Jane Brontë was an English novelist and poet who is best known for her only novel, Wuthering Heights, now considered a classic of English literature.",
      "publishedYear": 1847,
      "totalCopies": 13,
      "availableCopies": 11,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "gothic romance",
      "createdAt": { "seconds": 1700355200, "nanoseconds": 0 }
    },
    {
      "id": "the-power-of-now-tolle",
      "title": "The Power of Now",
      "author": "Eckhart Tolle",
      "category": "Non-Fiction",
      "summary": "A guide to spiritual enlightenment that emphasizes the importance of living in the present moment. Tolle argues that the mind is the source of all suffering and that by quieting the mind, we can achieve a state of peace and enlightenment.",
      "authorInfo": "Eckhart Tolle is a spiritual teacher and self-help author who is best known as the author of The Power of Now and A New Earth: Awakening to Your Life's Purpose. In 2011, he was listed by Watkins Review as the most spiritually influential person in the world.",
      "publishedYear": 1997,
      "totalCopies": 18,
      "availableCopies": 16,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "spiritual guide",
      "createdAt": { "seconds": 1700441600, "nanoseconds": 0 }
    },
    {
      "id": "the-book-thief-zusak",
      "title": "The Book Thief",
      "author": "Markus Zusak",
      "category": "Fiction",
      "summary": "A historical novel that tells the story of Liesel Meminger, a young girl living in Nazi Germany. The story is narrated by Death, who follows Liesel's life as she steals books and shares them with her neighbors during the bombing of her town.",
      "authorInfo": "Markus Frank Zusak is an Australian writer of German origin. He is best known for his two novels for young adults: The Book Thief and The Messenger, both of which became international bestsellers.",
      "publishedYear": 2005,
      "totalCopies": 27,
      "availableCopies": 24,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "historical fiction",
      "createdAt": { "seconds": 1700528000, "nanoseconds": 0 }
    },
    {
      "id": "the-woman-in-cabin-10-ware",
      "title": "The Woman in Cabin 10",
      "author": "Ruth Ware",
      "category": "Mystery",
      "summary": "A psychological thriller that follows Lo Blacklock, a journalist who is on assignment on a cruise ship. When she thinks she sees a body thrown overboard, she must convince the other passengers that a murder has taken place.",
      "authorInfo": "Ruth Ware, is a British psychological crime thriller author. Her novels include In a Dark, Dark Wood (2015), The Woman in Cabin 10 (2016), The Lying Game (2017), The Death of Mrs Westaway (2018), The Turn of the Key (2019), and One by One (2020).",
      "publishedYear": 2016,
      "totalCopies": 19,
      "availableCopies": 16,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "cruise ship",
      "createdAt": { "seconds": 1700614400, "nanoseconds": 0 }
    },
    {
      "id": "bird-box-malerman",
      "title": "Bird Box",
      "author": "Josh Malerman",
      "category": "Thriller",
      "summary": "A post-apocalyptic thriller that follows Malorie as she tries to guide her two children to safety in a world where an unseen entity causes people who see it to go insane and commit suicide.",
      "authorInfo": "Josh Malerman is an American novelist, short story writer, film producer, and one of two singer/songwriters for the rock band The High Strung.",
      "publishedYear": 2014,
      "totalCopies": 17,
      "availableCopies": 14,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "unseen entity",
      "createdAt": { "seconds": 1700700800, "nanoseconds": 0 }
    },
    {
      "id": "the-three-body-problem-liu",
      "title": "The Three-Body Problem",
      "author": "Cixin Liu",
      "category": "Sci-Fi",
      "summary": "The first book in the Remembrance of Earth's Past trilogy, this novel is a story of first contact with an alien civilization. Set against the backdrop of China's Cultural Revolution, the novel explores themes of science, politics, and philosophy.",
      "authorInfo": "Liu Cixin is a Chinese science-fiction writer. He is a nine-time winner of the Galaxy Award (China's most prestigious literary science fiction award) and a winner of the 2015 Hugo Award (for The Three-Body Problem) and the 2017 Locus Award (for Death's End).",
      "publishedYear": 2008,
      "totalCopies": 15,
      "availableCopies": 12,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "alien civilization",
      "createdAt": { "seconds": 1700787200, "nanoseconds": 0 }
    },
    {
      "id": "the-way-of-kings-sanderson",
      "title": "The Way of Kings",
      "author": "Brandon Sanderson",
      "category": "Fantasy",
      "summary": "The first book in The Stormlight Archive series, this high-fantasy epic is set in the world of Roshar, a world of stone and storms. The story follows a diverse cast of characters as they navigate a world on the brink of war.",
      "authorInfo": "Brandon Sanderson is an American author of epic fantasy and science fiction. He is best known for the Cosmere fictional universe, in which most of his fantasy novels, most notably the Mistborn series and The Stormlight Archive, are set.",
      "publishedYear": 2010,
      "totalCopies": 29,
      "availableCopies": 25,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "high fantasy",
      "createdAt": { "seconds": 1700873600, "nanoseconds": 0 }
    },
    {
      "id": "jane-eyre-bronte",
      "title": "Jane Eyre",
      "author": "Charlotte Brontë",
      "category": "Classic Literature",
      "summary": "A novel that follows the emotions and experiences of its eponymous character, including her growth to adulthood, and her love for Mr. Rochester, the brooding master of Thornfield Hall.",
      "authorInfo": "Charlotte Brontë was an English novelist and poet, the eldest of the three Brontë sisters who survived into adulthood and whose novels became classics of English literature.",
      "publishedYear": 1847,
      "totalCopies": 16,
      "availableCopies": 14,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "classic romance",
      "createdAt": { "seconds": 1700960000, "nanoseconds": 0 }
    },
    {
      "id": "the-subtle-art-of-not-giving-a-f-ck-manson",
      "title": "The Subtle Art of Not Giving a F*ck",
      "author": "Mark Manson",
      "category": "Non-Fiction",
      "summary": "A self-help book that argues that we should not try to be positive all the time, but instead learn to embrace our fears, faults, and uncertainties. Manson argues that by accepting our limitations, we can lead more fulfilling lives.",
      "authorInfo": "Mark Manson is an American self-help author, blogger and entrepreneur. He is the author of the website MarkManson.net and two books, The Subtle Art of Not Giving a F*ck: A Counterintuitive Approach to Living a Good Life, and Everything Is F*cked: A Book About Hope.",
      "publishedYear": 2016,
      "totalCopies": 25,
      "availableCopies": 22,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "counterintuitive approach",
      "createdAt": { "seconds": 1701046400, "nanoseconds": 0 }
    },
    {
      "id": "a-thousand-splendid-suns-hosseini",
      "title": "A Thousand Splendid Suns",
      "author": "Khaled Hosseini",
      "category": "Fiction",
      "summary": "A novel set in Afghanistan from the early 1960s to the early 2000s. It tells the story of two women, Mariam and Laila, whose lives become intertwined by war and fate.",
      "authorInfo": "Khaled Hosseini is an Afghan-American novelist, physician, activist, and UNHCR goodwill ambassador. His debut novel, The Kite Runner, was a critical and commercial success; the book and his subsequent novels have all been bestsellers.",
      "publishedYear": 2007,
      "totalCopies": 20,
      "availableCopies": 18,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "afghanistan story",
      "createdAt": { "seconds": 1701132800, "nanoseconds": 0 }
    },
    {
      "id": "the-guest-list-foley",
      "title": "The Guest List",
      "author": "Lucy Fokley",
      "category": "Mystery",
      "summary": "A whodunnit mystery that takes place on a remote island off the coast of Ireland, where a wedding is being held. When a storm cuts the island off from the mainland, and a body is discovered, everyone is a suspect.",
      "authorInfo": "Lucy Fokley is the author of The Hunting Party and The Guest List, both of which were New York Times bestsellers. She studied English literature at Durham University and the University of London and worked for several years as a fiction editor in the publishing industry.",
      "publishedYear": 2020,
      "totalCopies": 22,
      "availableCopies": 19,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "whodunnit mystery",
      "createdAt": { "seconds": 1701219200, "nanoseconds": 0 }
    },
    {
      "id": "it-king",
      "title": "It",
      "author": "Stephen King",
      "category": "Thriller",
      "summary": "A horror novel that tells the story of seven children from Derry, Maine, who are terrorized by an evil entity that preys on the local children. The children, who call themselves the Losers' Club, must confront their fears to defeat the monster.",
      "authorInfo": "Stephen Edwin King is an American author of horror, supernatural fiction, suspense, crime, science-fiction, and fantasy novels.",
      "publishedYear": 1986,
      "totalCopies": 23,
      "availableCopies": 20,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "evil clown",
      "createdAt": { "seconds": 1701305600, "nanoseconds": 0 }
    },
    {
      "id": "the-left-hand-of-darkness-le-guin",
      "title": "The Left Hand of Darkness",
      "author": "Ursula K. Le Guin",
      "category": "Sci-Fi",
      "summary": "A science fiction novel set on the planet Gethen, a world where the inhabitants are ambisexual, with no fixed gender. The story follows Genly Ai, a human ambassador who is sent to Gethen to persuade the planet to join an interplanetary confederation.",
      "authorInfo": "Ursula Kroeber Le Guin was an American author best known for her works of speculative fiction, including science fiction works set in her Hainish universe, and the Earthsea fantasy series.",
      "publishedYear": 1969,
      "totalCopies": 13,
      "availableCopies": 11,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "gender exploration",
      "createdAt": { "seconds": 1701392000, "nanoseconds": 0 }
    },
    {
      "id": "the-eye-of-the-world-jordan",
      "title": "The Eye of the World",
      "author": "Robert Jordan",
      "category": "Fantasy",
      "summary": "The first book in The Wheel of Time series, this high-fantasy epic is set in a world where magic exists and only women can use it. The story follows a group of young people from a remote village who are caught up in a struggle against the Dark One.",
      "authorInfo": "James Oliver Rigney Jr., better known by his pen name Robert Jordan, was an American author of epic fantasy. He is best known for his series The Wheel of Time, which comprises 14 books and a prequel novel.",
      "publishedYear": 1990,
      "totalCopies": 30,
      "availableCopies": 27,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "epic journey",
      "createdAt": { "seconds": 1701478400, "nanoseconds": 0 }
    },
    {
      "id": "great-expectations-dickens",
      "title": "Great Expectations",
      "author": "Charles Dickens",
      "category": "Classic Literature",
      "summary": "A novel that depicts the personal growth and personal development of an orphan nicknamed Pip. The novel is a bildungsroman, a coming-of-age story that follows Pip's journey from a young boy to a gentleman.",
      "authorInfo": "Charles John Huffam Dickens was an English writer and social critic. He created some of the world's best-known fictional characters and is regarded by many as the greatest novelist of the Victorian era.",
      "publishedYear": 1861,
      "totalCopies": 17,
      "availableCopies": 15,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "victorian era",
      "createdAt": { "seconds": 1701564800, "nanoseconds": 0 }
    },
    {
      "id": "the-7-habits-of-highly-effective-people-covey",
      "title": "The 7 Habits of Highly Effective People",
      "author": "Stephen Covey",
      "category": "Non-Fiction",
      "summary": "A self-help book that presents a principle-centered approach to personal and professional effectiveness. Covey argues that by adopting seven habits, we can become more effective in all areas of our lives.",
      "authorInfo": "Stephen Richards Covey was an American educator, author, businessman, and keynote speaker. His most popular book is The 7 Habits of Highly Effective People.",
      "publishedYear": 1989,
      "totalCopies": 21,
      "availableCopies": 18,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "personal development",
      "createdAt": { "seconds": 1701651200, "nanoseconds": 0 }
    },
    {
      "id": "the-goldfinch-tartt",
      "title": "The Goldfinch",
      "author": "Donna Tartt",
      "category": "Fiction",
      "summary": "A novel that tells the story of Theodore 'Theo' Decker, a young boy who survives an accident that kills his mother. The novel follows Theo's life as he navigates the art underworld and comes to terms with his past.",
      "authorInfo": "Donna Louise Tartt is an American author. Tartt's novels are The Secret History (1992), The Little Friend (2002), and The Goldfinch (2013).",
      "publishedYear": 2013,
      "totalCopies": 19,
      "availableCopies": 16,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "art underworld",
      "createdAt": { "seconds": 1701737600, "nanoseconds": 0 }
    },
    {
      "id": "the-maltese-falcon-hammett",
      "title": "The Maltese Falcon",
      "author": "Dashiell Hammett",
      "category": "Mystery",
      "summary": "A detective novel that features private investigator Sam Spade and his dealings with three unscrupulous adventurers, all of whom are competing to obtain a jewel-encrusted falcon statuette.",
      "authorInfo": "Samuel Dashiell Hammett was an American author of hard-boiled detective novels and short stories. He was also a screenwriter and political activist. Among the enduring characters he created are Sam Spade (The Maltese Falcon), Nick and Nora Charles (The Thin Man), and the Continental Op (Red Harvest and The Dain Curse).",
      "publishedYear": 1930,
      "totalCopies": 14,
      "availableCopies": 12,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "detective novel",
      "createdAt": { "seconds": 1701824000, "nanoseconds": 0 }
    },
    {
      "id": "the-silence-of-the-lambs-harris",
      "title": "The Silence of the Lambs",
      "author": "Thomas Harris",
      "category": "Thriller",
      "summary": "A psychological thriller that follows Clarice Starling, a young FBI trainee, who seeks the advice of the imprisoned and manipulative cannibalistic serial killer Dr. Hannibal Lecter to apprehend another serial killer, known only as 'Buffalo Bill'.",
      "authorInfo": "William Thomas Harris III is an American writer, best known for a series of suspense novels about his most famous character, Hannibal Lecter.",
      "publishedYear": 1988,
      "totalCopies": 24,
      "availableCopies": 21,
      "coverUrl": "https://placehold.co/400x600.png",
      "hint": "fbi trainee",
      "createdAt": { "seconds": 1701910400, "nanoseconds": 0 }
    }
]

    